#+STARTUP: beamer overview indent inlineimages logdrawer
#+TITLE: @@latex: Redirecionamento de Streams \\
#+TITLE: Padrão em Sistemas POSIX@@
#+AUTHOR:    \footnotesize Pedro Bruel \newline \scriptsize \emph{pedro.bruel@gmail.com}
#+DATE:      \scriptsize 18 de Junho de 2021
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:2 num:t toc:nil @:t \n:nil ::t |:t -:t f:t *:t <:t
#+OPTIONS:   tex:t latex:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:
#+LINK_HOME:

** Usando Arquivos de /Log/: Redirecionamento de Saída e Erros
#+begin_export latex
\begin{figure}
\begin{minipage}{.8\textwidth}
#+end_export

#+begin_SRC bash :exports both
date > existe.txt && cat existe.txt
#+end_SRC

#+RESULTS:
: Wed Jun 16 05:38:58 PM -03 2021

\vspace{-0.4em}
\pause

- Redirecionando *erro* e *saída* para arquivos diferentes:

\vspace{0.3em}

#+begin_SRC bash :exports both
cat existe.txt não-existe.txt 1> saída.log 2> erros.log
#+end_SRC

#+RESULTS:

\vspace{0.3em}
\pause

- Verificando os *logs*:

\vspace{0.3em}

#+begin_SRC bash :exports both
cat saída.log
#+end_SRC

#+RESULTS:
: Wed Jun 16 05:38:58 PM -03 2021

\pause

#+begin_SRC bash :exports both
cat erros.log
#+end_SRC

#+RESULTS:
: cat: não-existe.txt: No such file or directory

#+begin_export latex
\end{minipage}
\end{figure}
#+end_export

#+begin_SRC bash :exports none
rm *.log *.txt
#+end_SRC

#+RESULTS:

*** Monitorando o Consumo de Memória
#+begin_export latex
\begin{figure}
\begin{minipage}{\textwidth}
#+end_export
#+begin_SRC bash :exports code
free -h > mem.log && cat mem.log
#+end_SRC

#+RESULTS:
: total        used        free      shared  buff/cache   available
: Mem:            31Gi       7.2Gi       1.1Gi       1.4Gi        22Gi        22Gi
: Swap:             0B          0B          0B

\pause

#+begin_verbatim
               total        used        free      shared  buff/cache   available
Mem:            31Gi       7.2Gi       1.1Gi       1.4Gi        22Gi        22Gi
Swap:             0B          0B          0B
#+end_verbatim

\pause

#+begin_SRC bash :exports code
cat /proc/meminfo > meminfo.log
#+end_SRC

#+RESULTS:

#+begin_export latex
\end{minipage}
\end{figure}
#+end_export

*** Monitorando o Clock da CPU
#+begin_export latex
\begin{figure}
\begin{minipage}{0.9\textwidth}
#+end_export
#+begin_SRC bash :exports code
grep "cpu MHz" < /proc/cpuinfo > cpu_clock.log && cat cpu_clock.log
#+end_SRC

#+RESULTS:
: cpu MHz		: 3000.000
: cpu MHz		: 1746.784
: cpu MHz		: 3000.000
: cpu MHz		: 3000.000
: cpu MHz		: 3000.000
: cpu MHz		: 3000.000
: cpu MHz		: 900.006
: cpu MHz		: 900.001

\pause

#+begin_SRC bash :exports results
cat cpu_clock.log | sed "s/\t/    /g"
#+end_SRC
#+RESULTS:
: cpu MHz        : 3000.000
: cpu MHz        : 1746.784
: cpu MHz        : 3000.000
: cpu MHz        : 3000.000
: cpu MHz        : 3000.000
: cpu MHz        : 3000.000
: cpu MHz        : 900.006
: cpu MHz        : 900.001

#+begin_export latex
\end{minipage}
\end{figure}
#+end_export

\pause

** Exercício: Script de Redirecionamento
#+begin_export latex
\begin{figure}
\begin{minipage}{\textwidth}
#+end_export
#+begin_SRC bash :exports code :tangle ./src/bash_example/log.sh
#!/usr/bin/bash
/usr/bin/bash -c "$1 < $2 &> $3"
#+end_SRC

#+begin_SRC bash :exports code
./src/bash_example/log.sh 'grep "cpu MHz"' /proc/cpuinfo out.log && cat out.log
#+end_SRC

#+RESULTS:
: cpu MHz		: 1303.327
: cpu MHz		: 1682.174
: cpu MHz		: 3000.000
: cpu MHz		: 3000.000
: cpu MHz		: 3000.000
: cpu MHz		: 3000.000
: cpu MHz		: 3000.000
: cpu MHz		: 3000.000

#+begin_SRC bash :exports results
cat out.log | sed "s/\t/    /g"
#+end_SRC

#+RESULTS:
: cpu MHz        : 1303.327
: cpu MHz        : 1682.174
: cpu MHz        : 3000.000
: cpu MHz        : 3000.000
: cpu MHz        : 3000.000
: cpu MHz        : 3000.000
: cpu MHz        : 3000.000
: cpu MHz        : 3000.000

#+begin_export latex
\end{minipage}
\end{figure}
#+end_export

** Chamadas /dup/ e /dup2/
=int dup(int oldfd);=
- *Duplica* o descritor de arquivo =oldfd=, usando o menor descritor disponível

=int dup2(int oldfd, int newfd);=
- *Duplica* =oldfd= usando =newfd=, fecha =newfd= se necessário

#+begin_export latex
\begin{figure}
\begin{minipage}{.95\textwidth}
#+end_export

#+ATTR_LATEX: :options fontsize=\scriptsize
#+begin_SRC bash :exports code
man dup | grep "NAME" -A 10
#+end_SRC

#+RESULTS:
#+begin_example
NAME
       dup, dup2 — duplicate an open file descriptor

SYNOPSIS
include <unistd.h>

       int dup(int fildes);
       int dup2(int fildes, int fildes2);

DESCRIPTION
       The  dup()  function provides an alternative interface to the service provided by fc‐
#+end_example

#+begin_export latex
\begin{verbatim}[fontsize=\scriptsize]
NAME
  dup, dup2 — duplicate an open file descriptor

SYNOPSIS
  include <unistd.h>
  int dup(int fildes);
  int dup2(int fildes, int fildes2);

DESCRIPTION
  The  dup()  function provides an alternative interface to the service provided [...]
\end{verbatim}

\end{minipage}
\end{figure}
#+end_export

** Chamada /pipe/

=int pipe(int filedes[2]);=
- Abre  um  canal  de  comunicação *entre  processos*,  usando  *descritores  de
  arquivo*

#+begin_export latex
\begin{figure}
\begin{minipage}{.95\textwidth}
#+end_export

#+ATTR_LATEX: :options fontsize=\scriptsize
#+begin_SRC bash :exports code
man pipe | grep "NAME" -A 10
#+end_SRC

#+RESULTS:
#+begin_example
NAME
       pipe — create an interprocess channel

SYNOPSIS
include <unistd.h>

       int pipe(int fildes[2]);

DESCRIPTION
       The pipe() function shall create a pipe and place two file descriptors, one each into
       the arguments fildes[0] and fildes[1], that refer to the open file  descriptions  for
#+end_example

#+begin_export latex
\begin{verbatim}[fontsize=\scriptsize]
NAME
  pipe — create an interprocess channel

SYNOPSIS
  include <unistd.h>
  int pipe(int fildes[2]);

DESCRIPTION
  The pipe() function shall create a pipe and place two file descriptors, one each into
  the arguments fildes[0] and fildes[1], that refer to the open file  descriptions [..]
\end{verbatim}

\end{minipage}
\end{figure}
#+end_export

*** Exemplo em /C/                                          :B_block:BMCOL:
:PROPERTIES:
:BEAMER_env: block
:BEAMER_col: 0.3
:END:

#+begin_export latex
\begin{figure}
\begin{minipage}{\textwidth}
#+end_export
#+begin_SRC bash
tree src/pipe_example
#+end_SRC

#+RESULTS:
: src/pipe_example
: ├── Makefile
: ├── pipe_example.md
: ├── pipe_example.org
: └── pipe_ls_wc.c
:
: 0 directories, 4 files

#+begin_export latex
\end{minipage}
\end{figure}
#+end_export

